snlkuharlocal/src/Documents/КорректировкаКонтрактаСПроизводителем/КорректировкаКонтрактаСПроизводителем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаКонтрактаСПроизводителем</name>
  <comment>https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-152</comment>
  <basedOn>Document.КонтрактСПроизводителем</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.КонтрактыСПроизводителем</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.КонтрактСПроизводителем</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаEUR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.КорректировкаКонтрактаСПроизводителем</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контракт</name>
    <type>
      <types>CatalogRef.КонтрактыСПроизводителем</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/КорректировкаКонтрактаСПроизводителем/ObjectModule.bsl
#Область СобытияОбъекта

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено ИЛИ ДанныеЗаполнения.Пустая() Тогда Возврат; КонецЕсли;

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ДокОснование = ДанныеЗаполнения;
	Автор = ПараметрыСеанса.Пользователь;
	
	Дата = ТекущаяДатаСеанса();
	УстановитьНовыйНомер();
	
	ФлагЭтоСправочник = Ложь; ФлагЭтоДокумент = Ложь;
	
	ТипЗначения = ТипЗнч(ДанныеЗаполнения);
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
    		ФлагЭтоСправочник = Истина;
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
    		ИмяОснования = ДанныеЗаполнения.Метаданные().Имя;
		ФлагЭтоДокумент = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", ДанныеЗаполнения);
	Если ФлагЭтоДокумент Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(Товары.Количество, 0) КАК КоличествоИсх,
		|	ЕСТЬNULL(Товары.Количество, 0) КАК КоличествоФакт,
		|	ЕСТЬNULL(Товары.Цена, 0) КАК ЦенаИсх,
		|	ЕСТЬNULL(Товары.Цена, 0) КАК ЦенаФакт,
		|	Товары.Единица КАК Единица,
		|	ЕСТЬNULL(Товары.Коэффициент, 1) КАК Коэффициент,
		|	Товары.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	Документ." + ИмяОснования + ".Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокОснование";
		
		// " + ИмяОснования + "
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Товары.Очистить();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), Выборка);
		КонецЦикла;
	
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Всего");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Н_ЗаказыПоставщикам = Движения.ЗаказыПоставщикам;
	
	Валюты_Курсы = ПолучитьСтруктуруВалютИКурсы(Валюта, Курс, Дата, Договор);
	
	Для Каждого Стр ИЗ Товары Цикл
		
		Если Стр.Количество <> 0 И Стр.ЦенаФакт <> 0 Тогда
			
			Движение = Н_ЗаказыПоставщикам.Добавить();
			
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			
			Движение.Склад = Склад;
			Движение.Заказ = Ссылка;
			Движение.Контракт = Контракт;
			Движение.ВалютаДокумента = Валюта;
			Движение.Отправитель = Контрагент;
			
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Количество = Стр.Количество;
			Движение.СуммаРуб = глПересчет(Стр.ЦенаФакт * Стр.Количество, Валюта,Курс, Валюты_Курсы.ВалютаНац, 1);
			Движение.СуммаEUR = глПересчет(Стр.ЦенаФакт * Стр.Количество, Валюта,Курс, Валюты_Курсы.Евро, Валюты_Курсы.КурсЕвро);
			Движение.СуммаUSD = глПересчет(Стр.ЦенаФакт * Стр.Количество, Валюта,Курс, Валюты_Курсы.Доллары,	Валюты_Курсы.КурсДоллара);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Н_ЗаказыПоставщикам.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Неопределено;
	Контракт = Неопределено;
КонецПроцедуры

#КонецОбласти
